app/views/admin/items/new.html.erb

　　　　  <%= f.label :genre_id, "ジャンル" %>
　　　　　<%= f.collection_select :genre_id, Genre.all, :id, :name, class: "form-control" %>
---
SELECT "genres".* FROM "genres"