app/controllers/admin/customers_controller.rb

SELECT "customers".* FROM "customers"
---
  def index
    @customers = Customer.all

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @customer = Customer.find(params[:id])

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @customer = Customer.find(params[:id])

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "customers" SET "address" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["address", "大阪"], ["updated_at", "2021-08-24 01:10:09.153098"], ["id", 1]]
---
   def update
      @customer = Customer.find(params[:id])
      if @customer.update(customer_params)