app/controllers/admin/genres_controller.rb

SELECT "genres".* FROM "genres"
---
  def index
    @genres = Genre.all

INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "ヒトデ"], ["created_at", "2021-08-21 05:55:46.818237"], ["updated_at", "2021-08-21 05:55:46.818237"]]
---
  def create
    @genre = Genre.new(genre_params)
    if @genre.save

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @genre = Genre.find(params[:id])

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "cake"], ["updated_at", "2021-08-24 01:10:48.172311"], ["id", 1]]
---
  def update
    @genre = Genre.find(params[:id])
    if @genre.update(genre_params)