app/controllers/admin/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
    @items = Item.all

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @item = Item.find(params[:id])

INSERT INTO "items" ("genre_id", "price", "name", "image_id", "explanation", "created_at", "updated_at", "is_order_status") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @item = Item.new(item_params)
     if @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def edit
    @item = Item.find(params[:id])

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "items" SET "price" = ?, "image_id" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["price", 1001], ["image_id", nil], ["updated_at", "2021-08-24 01:08:27.491649"], ["id", 10]]
---
  def update
    @item = Item.find(params[:id])
    if @item.update(item_params)