app/controllers/admin/orders_controller.rb

SELECT "orders".* FROM "orders"
---
  def index
    @orders=Order.all