app/views/admin/orders/index.html.erb

                <td><%= order.delivery_name %></td>
                <td><%= order.order_details.sum(:quantity) %></td>
---
SELECT "orders".* FROM "orders"
SELECT SUM("order_details"."quantity") FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]