app/controllers/public/cart_items_controller.rb

  def create
    #カート内商品の有無
    if current_customer.cart_items.count >= 1
      #カートに入れた商品はすでにカートに追加済か？
      if nil != current_customer.cart_items.find_by(item_id: params[:cart_item][:item_id])
        #カート内の既存商品の情報取得
        @cart_item_u = current_customer.cart_items.find_by(item_id: params[:cart_item][:item_id])
        #既にある情報に個数を合算
        @cart_item_u.quantity += params[:cart_item][:quantity].to_i
        #情報の更新　個数カラムのみ
        @cart_item_u.update(quantity: @cart_item_u.quantity)
        #カートページ遷移
        redirect_to cart_items_path
      else
        #新しくカートの作成
        @cart_item = CartItem.new(cart_item_params)
        #誰のカートか紐付け
        @cart_item.customer_id = current_customer.id
        #情報を保存できるか？
        if cart_item.save
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ? AND "cart_items"."item_id" = ? LIMIT ?  [["customer_id", 5], ["item_id", 6], ["LIMIT", 1]]
SELECT COUNT(*) FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 2]]
UPDATE "cart_items" SET "quantity" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["quantity", 2], ["updated_at", "2021-08-23 11:25:45.033854"], ["id", 1]]
INSERT INTO "cart_items" ("item_id", "quantity", "created_at", "updated_at", "customer_id") VALUES (?, ?, ?, ?, ?)  [["item_id", 7], ["quantity", 1], ["created_at", "2021-08-23 11:34:44.658670"], ["updated_at", "2021-08-23 11:34:44.658670"], ["customer_id", 5]]

    else
      @cart_item = CartItem.new(cart_item_params)
      @cart_item.customer_id = current_customer.id
      if @cart_item.save
---
INSERT INTO "cart_items" ("item_id", "quantity", "created_at", "updated_at", "customer_id") VALUES (?, ?, ?, ?, ?)  [["item_id", 1], ["quantity", 3], ["created_at", "2021-08-21 06:00:39.260039"], ["updated_at", "2021-08-21 06:00:39.260039"], ["customer_id", 2]]

  def update
    @cart_item = CartItem.find(params[:id])
    @cart_item.update(cart_item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cart_items" SET "quantity" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["quantity", 4], ["updated_at", "2021-08-23 11:34:15.984505"], ["id", 1]]

  def destroy
    @cart_item = CartItem.find(params[:id])
    @cart_item.destroy
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]

  def destroy_all
    @cart_item = current_customer.cart_items
    @cart_items.destroy_all
---
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]