app/controllers/public/customers_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @customer = Customer.find(params[:id])

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @customer = Customer.find(params[:id])

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    @customer = Customer.find(params[:id])