app/controllers/public/delivery_addresses_controller.rb

  def index
    @deliveryes = DeliveryAddress.all
---
SELECT "delivery_addresses".* FROM "delivery_addresses"

  def edit
    @address = DeliveryAddress.find(params[:id])
---
SELECT  "delivery_addresses".* FROM "delivery_addresses" WHERE "delivery_addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @delivery_address = DeliveryAddress.new(delivery_address_params)
    @delivery_address.customer_id = current_customer.id
    @delivery_address.save!
---
INSERT INTO "delivery_addresses" ("address", "postal_code", "name", "created_at", "updated_at", "customer_id") VALUES (?, ?, ?, ?, ?, ?)  [["address", "大阪府"], ["postal_code", "10101010"], ["name", "ccccc"], ["created_at", "2021-08-23 07:07:58.454958"], ["updated_at", "2021-08-23 07:07:58.454958"], ["customer_id", 2]]

  def update
    @address = DeliveryAddress.find(params[:id])
    @address.customer_id = current_customer.id
    if @address.update(delivery_address_params)
---
SELECT  "delivery_addresses".* FROM "delivery_addresses" WHERE "delivery_addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "delivery_addresses" SET "postal_code" = ?, "address" = ?, "name" = ?, "updated_at" = ? WHERE "delivery_addresses"."id" = ?  [["postal_code", "101010ddd10"], ["address", "ddd大阪府"], ["name", "dddd"], ["updated_at", "2021-08-23 07:12:44.306857"], ["id", 1]]

  def destroy
    @deliveryes = DeliveryAddress.find(params[:id])
    @deliveryes.destroy
---
SELECT  "delivery_addresses".* FROM "delivery_addresses" WHERE "delivery_addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "delivery_addresses" WHERE "delivery_addresses"."id" = ?  [["id", 1]]