app/controllers/public/items_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."is_order_status" = ? LIMIT ? OFFSET ?  [["is_order_status", 1], ["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items" WHERE "items"."is_order_status" = ?  [["is_order_status", 1]]
SELECT COUNT(*) FROM "items"
SELECT "genres".* FROM "genres" WHERE "genres"."valid_invalid_status" = ?  [["valid_invalid_status", 0]]
---
  def index
    @items = Item.where(is_order_status: 1).page(params[:page]).per(8)
    @quantity = Item.count
    @genres = Genre.where(valid_invalid_status: 0)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "genres".* FROM "genres" WHERE "genres"."valid_invalid_status" = ?  [["valid_invalid_status", 0]]
---
  def show
    @item = Item.find(params[:id])
    @cart_item = CartItem.new
    @genres = Genre.where(valid_invalid_status: 0)

SELECT  "items".* FROM "items" WHERE "items"."genre_id" = ? LIMIT ? OFFSET ?  [["genre_id", 1], ["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items" WHERE "items"."genre_id" = ?  [["genre_id", 1]]
SELECT "genres".* FROM "genres" WHERE "genres"."valid_invalid_status" = ?  [["valid_invalid_status", 0]]
---
  def search
    @items = Item.where(genre_id: params[:format]).page(params[:page]).per(8)
    @quantity = Item.where(genre_id: params[:format]).count
    @genres = Genre.where(valid_invalid_status: 0)