app/controllers/public/orders_controller.rb

  def index
    @order = current_customer.orders
---
SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = ?  [["customer_id", 2]]

  def show
    @order = Order.find(params[:id])
    @order_details = @order.order_details
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 2]]

  def create
    @order = Order.new(order_params) #初期化代入
    @order.customer_id = current_customer.id #自身のidを代入
    @order.save #orderに保存
    #order_itmemの保存
    current_customer.cart_items.each do |cart_item| #カートの商品を1つずつ取り出しループ
      @order_item = OrderDetail.new #初期化宣言
      @order_item.item_id = cart_item.item_id #商品idを注文商品idに代入
      @order_item.quantity = cart_item.quantity #商品の個数を注文商品の個数に代入
      @order_item.item_with_tax = (cart_item.item.price*1.1).floor #消費税込みに計算して代入
      @order_item.order_id =  @order.id #注文商品に注文idを紐付け
      @order_item.save #注文商品を保存
    end
    current_customer.cart_items.destroy_all
---
INSERT INTO "orders" ("payment", "shipment_charge", "postal_code", "delivery_address", "delivery_name", "total_price", "created_at", "updated_at", "customer_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 2]]
INSERT INTO "order_details" ("item_id", "order_id", "quantity", "item_with_tax", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["item_id", 1], ["order_id", 1], ["quantity", 16], ["item_with_tax", 8800], ["created_at", "2021-08-21 15:24:52.011206"], ["updated_at", "2021-08-21 15:24:52.011206"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]

  def confirm
    params[:order][:payment] = params[:order][:payment].to_i #payment_methodの数値に変換
    @order = Order.new(order_params) #情報を渡している
  #分岐
    if params[:order][:address_number] == "1" #address_numberが　”1”　なら下記　ご自身の住所が選ばれたら
      @order.postal_code = current_customer.postal_code #自身の郵便番号をorderの郵便番号に入れる
      @order.delivery_address = current_customer.address #自身の住所をorderの住所に入れる
      @order.delivery_name = current_customer.last_name_kanji+current_customer.first_name_kanji #自身の宛名をorderの宛名に入れる

    elsif  params[:order][:address_number] ==  "2" #address_numberが　”2”　なら下記　登録済からの選択が選ばれたら
      @order.postal_code = DeliveryAddress.find(params[:order][:address]).postal_code #newページで選ばれた配送先住所idから特定して郵便番号の取得代入
      @order.delivery_address = DeliveryAddress.find(params[:order][:address]).address #newページで選ばれた配送先住所idから特定して住所の取得代入
      @order.delivery_name = DeliveryAddress.find(params[:order][:address]).name #newページで選ばれた配送先住所idから特定して宛名の取得代入

    elsif params[:order][:address_number] ==  "3" #address_numberが　”3”　なら下記　新しいお届け先が選ばれたら
      @address = DeliveryAddress.new() #変数の初期化
      @address.address = params[:order][:address] #newページで新しいお届け先に入力した住所を取得代入
      @address.name = params[:order][:name] #newページで新しいお届け先に入力した宛名を取得代入
      @address.postal_code = params[:order][:postal_code] #newページで新しいお届け先に入力した郵便番号を取得代入
      @address.customer_id = current_customer.id #newページで新しいお届け先に入力したmember_idを取得代入
      if @address.save #保存
      @order.postal_code = @address.postal_code #上記で代入された郵便番号をorderに代入
      @order.delivery_name = @address.name #上記で代入された宛名をorderに代入
      @order.deaddress = @address.address #上記で代入された住所をorderに代入
      else
       render 'new'
      end
    end

    @cart_items = CartItem.where(customer_id: current_customer.id)
---
SELECT "delivery_addresses".* FROM "delivery_addresses" WHERE "delivery_addresses"."customer_id" = ?  [["customer_id", 1]]
SELECT  "delivery_addresses".* FROM "delivery_addresses" WHERE "delivery_addresses"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "delivery_addresses".* FROM "delivery_addresses" WHERE "delivery_addresses"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "delivery_addresses" ("address", "postal_code", "name", "created_at", "updated_at", "customer_id") VALUES (?, ?, ?, ?, ?, ?)  [["address", "kanagawa"], ["postal_code", "〒1111111"], ["name", "tarou"], ["created_at", "2021-08-24 01:47:12.770727"], ["updated_at", "2021-08-24 01:47:12.770727"], ["customer_id", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 2]]

  def order_new?
    redirect_to cart_items_path, notice: "カートに商品を入れてください。" if current_customer.cart_items.blank?
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 2]]