app/controllers/homes_controller.rb

    def top
      @genres = Genre.where(valid_invalid_status: 0) # ジャンルの無効ステータスを除外する
      @items = Item.limit(8).offset(4) # 先頭から5つのレコードから８つを取得
---
SELECT "genres".* FROM "genres" WHERE "genres"."valid_invalid_status" = ?  [["valid_invalid_status", 0]]
SELECT  "items".* FROM "items" LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 4]]