app/views/public/orders/index.html.erb

      <td><%= order.delivery_address %></td>
      <td><% order.order_details.each do |order_item| %>
---
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]