app/views/public/orders/new.html.erb

SELECT "delivery_addresses".* FROM "delivery_addresses" WHERE "delivery_addresses"."customer_id" = ?  [["customer_id", 2]]
---
          <label style=""><%= f.radio_button :address_number ,2 %> 登録済住所からの選択</label><br>
          <div style=" "><%= f.collection_select :addresses, @current_customer.delivery_addresses.all, :id, :address_all %>