app/views/public/orders/show.html.erb

<strong>注文情報</strong>
<%= if Order_detail.exists? %>
---
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 2]]